improved ReadMe
